[{"metadata": {"initial_data_id": "train:ordered_3804", "session_id": 3}, "dialog": "Speaker 1: What do you raise on your farm?\nSpeaker 2: Really just cows and chickens. I love each and every single one. How goes the duck hunt?\nSpeaker 1: Last duck hunting season was great! I am looking forward to this upcoming season and am training a new dog to help with the hunt. Do you do any type of hunting?\nSpeaker 2: I haven't I don't think I would be any good at it, plus I don't think I have the stomach for it. What kind of dog are you training? I love dogs!\nSpeaker 1: I love them too! The dog is a Chesapeake Bay Retriever. How are your dogs doing?\nSpeaker 2: They are doing well. They love having so much land to run around in and are very protective of me. I'm thinking about getting another dog or two\nSpeaker 1: Aww good! And what type of dogs are you thinking about getting?\nSpeaker 2: I don't have any kind of dog in particular. I like going to the rescue center to find dogs that need a home. Do you train all your dogs to help you with the hunt?\nSpeaker 1: That is so great of you to go to rescue centers. This is actually only the second dog I have trained to help with duck hunting, my other dogs are just pets.\nSpeaker 2: Oh wow, how many dogs do you have now?\nSpeaker 1: I have four dogs, two great danes, one chesapeake and one yorkie that think's it rules the whole farm. \nSpeaker 2: Yorkies are so cute! How is it having those huge great danes?", "personas": [["I duck hunt.", "I have ducks on my farm. I live on a farm near the Rocky Mountains. I do hiking and rock climbing. I am a competitive ski jumper. I grow corn on my farm. Sometimes I grow livestock.", "I prefer the farm to the city.", "I have great danes. I love dogs. ", "I like physical labor."], ["I have mutts. I love dogs.", "I like to swim and listen to music.", "I have mortgage.", "I like farm life. I live on a farm. I like physical labor.", "I do rock climbing and hiking.", "I work in HR. I work at a school district. I like talking to people at my job."]], "init_personas": [["I didn t go to college because I run the family farm.", "I like tailgate parties.", "I had a girlfriend who eloped with my best friend one day.", "I've never been on an airplane.", "My favorite season is duck hunting season."], ["I like swimming.", "I love dogs.", "My favorite color is purple.", "I own a home.", "My favorite band is korn."]]}, {"metadata": {"initial_data_id": "train:ordered_38", "session_id": 1}, "dialog": "Speaker 1: Other than your father, who are your favorite writers to read and to teach?\nSpeaker 2: I love teaching old poets.  Edgar Allen Poe is my favorite to teach about!  Have you gone skiing lately?\nSpeaker 1: Nice. I like Edgar Allen Poe. He has great work. No I have not went skiing lately. It has been too cold for me to want to leave the house. How about you?\nSpeaker 2: I'm thinking about taking a trip up North to do some skiing sometime soon.  I have to wait until we have a break at school.  I want to go back to Ireland over the summer too.  So hard to plan my vacations around my limited breaks from teaching!\nSpeaker 1: I understand how hard it could be to plan with lack of time available. I would love to travel up North to ski. I have not travelled much outside of my area but I hear there are a lot of great ski resorts up north. What is Ireland like? I have never been there.\nSpeaker 2: It's beautiful!  My mother always told me stories about growing up in Ireland so I had to visit to see it for myself and it was everything she said it was!  Mountains and cliffs and sea side towns!  You probably have some of the seaside towns in Seattle too though!\nSpeaker 1: That sounds amazing! Yea we do but the weather is not as near as nice as the weather in Ireland. It rains a lot. I would love to visit Ireland one day in the future. That is on my to travel list. Do you typically travel alone or with family?\nSpeaker 2: It depends on the trip.  Sometimes I just like being alone and doing my own thing but other times it's nice to have company so I take along my family!  What is your favorite part about Seattle?\nSpeaker 1: I would say the mountains and nature in Seattle are what I like the most when I get to enjoy them!\nSpeaker 2: Do you ever see any cool animals in the mountains?  I love looking for wild animals when I travel!  There are penguins in Ireland!\nSpeaker 1: I enjoy looking for wild animals as well. I have seen a lot of Elk. Thankfully nothing dangerous like the bears and cougars. I love penguins! I didn't know they were in Ireland.\nSpeaker 2: They're only on the coast!  It would be cool to see elk in person!  I'd probably be scared to see a bear!!! ", "personas": [["I ski.", "I live in Seattle."], ["I love shoes.", "I love to travel and read. I have traveled to Ireland and Australia.", "My mother was born in ireland. My father was born in australia.  I live in California.", "I am an English teacher.", "My father is a book writer.", "My dad just wrote a sci fiction book on time travel."]], "init_personas": [["I own 30 pairs of shoes.", "I love to skate and ski.", "I have 4 cats and 2 dogs.", "My car has to be as fast as my motorcycle."], ["My mother was born in ireland.", "My father was born in australia.", "My father was an author.", "I've traveled to both ireland and australia."]]}, {"metadata": {"initial_data_id": "valid_92", "session_id": 2}, "dialog": "Speaker 1: Have you looked into starting your container garden?\nSpeaker 2: I have! Got some seedlings in my windowsill and keep moving them out when they're big enough. How's your garden?\nSpeaker 1: It is going pretty good. I am hoping that the strawberries come in ok, I sometimes have birds getting after them.\nSpeaker 2: We get a lot of birds in our garden too, do you get netting to protect your fruit? \nSpeaker 1: I need to. I just need to get a frame built to put it over. Do you have any suggestions?\nSpeaker 2: I just use some bamboo canes with netting attached for mine. You still feeling able to get out and do much or have you managed to talk the kids into helping?\nSpeaker 1: Ha! They really don't want to help. They will eat the preserves and salsa I make, but don't want any part of the care and upkeep. How are the rabbits doing?\nSpeaker 2: Haha, sounds like most kids. Still plenty to look after. People come to adopt them, but feels like two arrive for every one we rehome.\nSpeaker 1: I guess they multiply like rabbits! Lol. Do you ever adopt any of them?\nSpeaker 2: I do take some home. That's why I decided to do some container gardening. Easier to stop them from eating everything when they get out!\nSpeaker 1: I bet that would be a hassle. Rabbits can be really cute, though. Maybe I'll come look at adopting one!\nSpeaker 2: They are really cute! I'll bring some over sometime soon for you to spend some time with. They're quite therapeutic when they're on your lap.", "personas": [["I have cancer. I don't have a smartphone.", "I eat mushrooms from the garden. I like pizza. I grow tomatoes, peppers, cucumbers, green beans, lettuce, strawberries and blueberries in my garden.", "I am retired. I served in Vietnam.", "I have grandchildren who are brats.", "My health is not good. I live a good life so far.  I only have 6 months to a year to live."], ["I work in a shipyard.", "I donate money to charity from my salary. I volunteer at a rabbit rescue.", "I live in an apartment.", "I would like to get started on container gardening."]], "init_personas": [["I have amazing children and grandchildren.", "I had cancer but its gone now.", "I'm retired and living the great life.", "I don't have a smartphone."], ["I work fulltime in a shipyard.", "I donate a part of my salary to charity each month.", "I volunteer my time with a local bunny rescue.", "My favorite color is navy blue."]]}, {"metadata": {"initial_data_id": "train:ordered_927", "session_id": 2}, "dialog": "Speaker 1: I know you don't like football, but did you hear about the major trade that happened in Baseball?  I think the Yankees will really have a chance to win this year because of it.\nSpeaker 2: That trade was crazy! I don't know what Philly was thinking giving away a player like that, but I still think the Yankees need more pitching to win it all. \nSpeaker 1: How is your diet? I almost broke this week when my roommates girlfriend brought over brownies. \nSpeaker 2: Not so good... My sister had a birthday and I caved and had cake. I justified it by going for an extra run, but I still felt gross afterwards. Have you been able to relax this week?\nSpeaker 1: Yea, my ACL tear may take a little while longer to heal though. Are you trail running or just on the roads?\nSpeaker 2: Gosh, I didn't realize it was an ACL tear. That's awful. I try to switch it up. Trail running is more fun but takes a lot more planning and time. What kind of rehab do they have you doing?\nSpeaker 1: I had some PRP injections, and now there are some light stretches and using a band to do some PT. Have you ever torn anything running?\nSpeaker 2: I've had sprains and tendonitis but thankfully haven't torn anything. *Knock on Wood* At some point I should switch to something lower impact or cross train a bit. Will you get to even suit up this year or is it all just rehab? How do you keep PT interesting? I would think it might get boring.\nSpeaker 1: its SO boring. I have an assessment coming up next week to see if I can get back into the game. \nSpeaker 2: I hope that goes well for you! I may not care for football much but anything has to be better than PT. Will your diet have to change once you are playing again?\nSpeaker 1: Yup. Gotta cut out those brownies! I wish I could just sneak in an extra run like to you to make up from them.\nSpeaker 2: Haha! I was wondering if they would but you on like a higher protein diet or something like that once you are going full speed again. I've been following the NBA and some of those guys have switched to plant-based diets and things like that as they have gotten older. ", "personas": [["I am a quarterback.", "My favorite team is the Eagles.", "This is my second year in the league.", "I have been playing football since I was young.", "I love football and baseball. I am not playing football this week because I need to rest. I am on a diet."], ["I don't like football.", "I like bagels and cookies.", "I like almost every sport, except for football.", "I am on a diet too.  I am a runner."]], "init_personas": [["I play quarterback.", "Last season I was just getting started.", "This is my second year in the league.", "I play for the philadelphia eagles.", "This season, I'll become a playoff quarterback."], ["My favorite drink is coke.", "I like to run.", "I like to make cookies.", "I like to train dogs.", "I like bagels with everything on them."]]}, {"metadata": {"initial_data_id": "train:ordered_6984", "session_id": 2}, "dialog": "Speaker 1: I stole some of the candy back that my wife confiscated from me after she stopped being angry.\nSpeaker 2: Ooh, nice. What got you in trouble?\nSpeaker 1: I let my kids stay up and eat Halloween candy. I did it when I was a kid and it was a great memory. Would you rather be 40 and remember going to bed every halloween or staying up building memories with your dad?\nSpeaker 2: Well as long as they don't eat too much I don't see the harm. How was the candy haul this year?\nSpeaker 1: great. We had a fund time. I just wish my wife liked to have more fun with them. Why have kids if you can't have fun?\nSpeaker 2: I think your wife probably wants to have fun but feels like she can't. My dad was kinda the same way when I was a kid.\nSpeaker 1: Yeah it is hard. How was that when you were a kid? what was your dad like?\nSpeaker 2: He was closed off from me and my siblings. Never really did any activities with us. He loosened up in my teens but it hurt when I was little.\nSpeaker 1: See and I don't want to do that. Did you get to have fun on halloween? get any candy?\nSpeaker 2: Yeah I always got to have fun with my siblings. Not like Dad was mean or anything, just kinda distant I guess? Makes me a little nervous to be a dad myself.\nSpeaker 1: What about this year? did you and your gf get to have a good halloween?\nSpeaker 2: Spent it handing out candy this year. Figured we'd skip the parties this time since I'm avoiding booze.", "personas": [["I do a lot of shopping. I know how to bow hunt.", "I hope to dress my daughters in Hunger Games costumes for Halloween. I have 3 daughters. I let my kids stay up late on Halloween. My wife is the disciplinarian in the house while I'm the fun parent."], ["My girlfriend lives next door.", "I have a large mustache.", "I am in recovery.  I have not had any alcohol in a long time.", "I like candy."]], "init_personas": [["I like to shoot a bow.", "I like to remodel homes.", "I like to go hunting.", "I like to go shopping with my daughters.", "My favorite holiday is halloween."], ["I'm a recovering alcoholic.", "I've a large mustache.", "My girl friend lives in the condo next door.", "I am a retired newspaper reporter."]]}, {"metadata": {"initial_data_id": "test_435", "session_id": 1}, "dialog": "Speaker 1: How did you get on at karate this week? Any new belts? \nSpeaker 2: No new belts, but there is a competition next week, so I am getting some extra practice in. Do your kids take karate lessons?\nSpeaker 1: Yes, if you count them beating me up everyday! They get most of their exercise running around the yard and climbing trees. Its a little different than the beach where you live! \nSpeaker 2: True - that sounds fun. It must be fun to have siblings, I am an only child, so never got to experience any of that.\nSpeaker 1: We also count the dogs as part of the family so it is never quiet around here! What movies do you like to watch?\nSpeaker 2: My favorite are horror movies, the older ones like Nightmare on Elm Street, and Halloween. But I have to tell you, I am a sucker for those silly romantic comedies.\nSpeaker 1: I agree, no shame in a romantic comedy! Horror movies keep the kids up so we tend to keep it on the lighter side. Harry Potter has been popular in our house. Have you seen any of them?\nSpeaker 2: I haven't, I did read the books. I heard the movies couldn't live up to the books, so I have been avoiding them. Plus, there are sooo many. I feel like I would have to watch them all.\nSpeaker 1: Too many, but you read the books! I give you a lot of credit for that. I have not read anything longer than 1 page in a few years. \nSpeaker 2: I like to read, gets me out of the house, but still enables me to be lazy! I have a patio in my backyard, so it's nice to get out there and catch some rays.\nSpeaker 1: That sounds so cool! I have a nice porch that I sit on a lot but usually it just for a few minutes. Someday I will get back into reading, maybe even Harry Potter!\nSpeaker 2: I am sure it's difficult to find the time to do that with kids/pets/family. ", "personas": [["I live on a farm. i live in the country.", "I have 3 children. My kids keep me active.", "I love dogs.", "I work in the computer industry.", "I was a nerd in high school."], ["I am a lifeguard. I live near water.", "I do not have children. i am in a long-term relationship.", "I do not have any pets. I do karate. I am a busy person.", "i like to watch movies. I am a couch potato. I like horror movies.", "I was captain of the football team in highschool."]], "init_personas": [["I like dogs.", "I live on a farm.", "I work for the computer industry.", "I love my job.", "I have three kids."], ["I was captain of my football team.", "I'm in a committed relationship.", "I love watching horror movies.", "I practice karate.", "I work as a lifeguard on the beach."]]}, {"metadata": {"initial_data_id": "train:ordered_5250", "session_id": 2}, "dialog": "Speaker 1: I have arrived to Japan and its a beautiful place to draw.\nSpeaker 2: I'm jealous, I would love to visit Japan sometime in the future. What has been your favorite thing to draw so far?\nSpeaker 1: I've been loving drawing the cherry blossoms and zen gardens. The spring season makes everything so vibrant here. You should definitely visit someday.\nSpeaker 2: Those sound lovely, hope to see them when I do get to visit Japan. Did you bring along Bob with you on the trip, or did you find someone to take care of him while you're away?\nSpeaker 1: I did actually! I made a couple friends recently and one of them happily agreed to care for him. How are you doing with making friends too?\nSpeaker 2: Its been going alright, I met a couple of people recently and I think it went okay. We were able to talk about our common interests, and we decided to get together and go to the beach this summer.\nSpeaker 1: That's phenomenal, congratulations! What interests do you all share?\nSpeaker 2: We all like to dance and listen to music, although we don't often go to crowded places to do so. We also are interested about hair care, and different hair styles.\nSpeaker 1: I'm so glad! What kind of music do you all like?\nSpeaker 2: Mostly instrumental genres, like EDM with no lyrics because we all don't really like to sing along to the music we listen to.\nSpeaker 1: That makes sense, I like EDM too. That, and Lo-Fi. Do you ever listen to Lo-Fi?\nSpeaker 2: Sometimes, but not as much as other genres. I wish I could just listen to music at my job, but then I wouldn't be able to hear the customers place their orders.", "personas": [[" I have autism. I wish I could live in a fantasy world. I don't have friends. I am trying to make friends. I have long hair.", "I like to draw. I do not like to take notes. I like to make jokes.", "I have a pet lizard named Bob.", "I am going on a free trip to japan next week with a crew of autism members."], ["I have poor social skills. I do not have many friends. I have autism. I do not sing. I dance alone. I don't like touching other people.", "I like my new job. I work at Subway where I eat some sandwiches every once in a while.", "I have long hair. I am a female.", "I do not own any lizards. I do not like reptiles.", "I am going to the beach this summer.", "I have never been to Japan."]], "init_personas": [["I draw during classes instead of taking notes.", "I like lizards.", "I have long hair for a boy.", "I wish I could live in a fantasy world.", "I don t have many friends."], ["I've aspergers.", "I take everything literally.", "I started a new job this year, which is helping me learn more about socialization.", "I am very genuine, and don t like small talk."]]}, {"metadata": {"initial_data_id": "valid_343", "session_id": 1}, "dialog": "Speaker 1: I just got back from riding one of my horses. \nSpeaker 2: Well, that makes for a wonderful morning outing. I haven't ridden today. \nSpeaker 1: It was very enjoyable! When was the last time you went horseback riding?\nSpeaker 2: About a week ago. I've been so busy with my plumping business. Seems like every tap around here is leaking. Do you ride often?\nSpeaker 1: Everyday. The horses on the farm need to get their exercise. Do your kids like riding as well?\nSpeaker 2: They do, but they're just learning to trot. Every time I take them, we go for ice cream afterwards. I'm not sure what they like more - the horses or the cones. \nSpeaker 1: Ice cream sounds like a great treat. I might go get some myself. What flavors do you enjoy?\nSpeaker 2: I'm kind of boring. Usually a good quality vanilla is my fave. My kids like those space color ones that stain their faces. What about you?\nSpeaker 1: Salted Oreo. It sounds odd but it is amazing!\nSpeaker 2: Oh, I'd probably like that. Here in the country there a little shop that sells the best salted caramel. After a big plumping job, I treat myself. \nSpeaker 1: The farm might need some plumbing work soon. Do you work on older buildings?\nSpeaker 2: Yes, all kinds of buildings. Not to brag, but I'm the best around here. Plus my prices are reasonable. Let me know if you'd like a quote. ", "personas": [["I came from a large family. I like ice cream.", "I live on a horse farm in a small town. I was born and raised on a horse farm. I love horses."], ["I have a wife and three children. My children like ice cream.", "I am a plumber.", "I live in the country. I have dogs.", "I love horses. I love animals."]], "init_personas": [["I was raised on a horse farm.", "My family has raised horses for a generations.", "I am from a small town.", "I dream of moving to the city."], ["My favorite ice cream flavor is chocolate.", "I love going to the park with my three children and my wife.", "My wife and kids are the best.", "I'm a plumber."]]}, {"metadata": {"initial_data_id": "valid_766", "session_id": 2}, "dialog": "Speaker 1: I just ate some chocolate ice cream and it's the best I ever had!\nSpeaker 2: That sounds yummy! I love cookies and cream. \nSpeaker 1: We often have ice cream for dessert on a Saturday night. My wife puts out chocolate sauce, sprinkles, bananas, and cherries, and everyone gets to make their own sundae.\nSpeaker 2: Oh that sounds like a lot of fun. I hope to have a family in the future to do the same type thinfs.\nSpeaker 1: It's great being a dad. I love my kids so much and it's fun to teach them things and do things with them.\nSpeaker 2: What other types of family things do yall enjoy as a family. \nSpeaker 1: I like to build things with my oldest daughter. \nSpeaker 2: What types of things do you like to build?\nSpeaker 1: We built a bridge over a small creek in the backyard. That was very challenging but she loved every minute of it!\nSpeaker 2: OH wow!!! I bet that turned out great! \nSpeaker 1: It did! She is so proud of making that.\nSpeaker 2: She should be! That's awesome you are teaching her soo much!", "personas": [["I sometimes work as a plumber. i do plumbing jobs ocassionally.", "I have children and a wife.", "We currently do not have a dog. I would like an active dog.", "My favorite flavor of ice cream is chocolate.", "My oldest kid is a girl and is 13. my 13 year old wants to be an engineer when shes older.", "my wife is a homemaker who manages and keeps the kids on schedule."], ["I like rock climbing.", "I do not have children. I do not have a partner. I would love kids when im married.", "My pet dog is a black lab. I go hiking with my dog.", "I work as an engineer.", "I love going to lewis creek at least twice a month.", "my company is working on a protype."]], "init_personas": [["I have three children.", "My wife and kids are the best.", "My favorite ice cream flavor is chocolate.", "I am a plumber."], ["My favorite activity is rock climbing.", "I like to go hiking in the spring.", "I have a black lab named trooper.", "I'm a mechanical engineer.", "I live in colorado."]]}, {"metadata": {"initial_data_id": "test_371", "session_id": 3}, "dialog": "Speaker 1: What about the Bears make them your favorite NFL team? They happen to be my favorite as well. \nSpeaker 2: I just think they not only have a love of the game, but they seem like such an outgoing group and you can really tell they put their best foot forward every game!\nSpeaker 1: I agree. They play a really great game also. I am hoping to get tickets for the next game\nSpeaker 2: Have you been to a lot of their games before? Who is your favorite player?\nSpeaker 1: I have been to a couple. I really like the quarterback right now. What is your favorite player.\nSpeaker 2: I don't really have one yet, I loved Cutler but i haven't loved many of them as much as him yet! Do you prefer watching live games over television?\nSpeaker 1: Live is ok, but it seems to take longer for some reason. Plus with on television I can use commercials to get snacks.\nSpeaker 2: I bet the snacks are a lot cheaper too then at the live games! I have heard they can get expensive, but I have never been so I may be wrong, what do you think? \nSpeaker 1: Yeah, last time I went it cost me like $20 for some nachos and a soda. Crazy, but it can be fun.\nSpeaker 2: Yeah one of those splurges but worth it. I'd probably be sneaking snacks in if I ever went, or eating until I felt like I could explode pre-game!\nSpeaker 1: You got to get at least 1 snack at the game. It is all part of the experience.\nSpeaker 2: I feel like you gotta get a hot dog and a beer, I have no idea why but it just seems like the stadium experience. What was your first snack experience at your first game? DId you have like a moment of I dont know why but this , this is the snack?", "personas": [["My favorite game is League of Legends. I like watching football on a gaming app. I am a professional gamer. I make good money.", "Cheetos are my favorite food.", "I am going to be in a National gaming tournament. I have participated in local gaming tournaments before. I stream video games without showing my face.", "I like the Bears. I also like Manchester United. I have been to a soccer match before.", "I got second place and won a fairly big cash prize at the gaming tournament yesterday. I did well this time and had my best game, although the competition was fierce. I have seen the same people at the last three tournaments I've attended.", "I like fantasy RPG style games."], ["I do not play video games. I am blonde.", "I like the outdoors.", "I work in therapeutic treatment. My mom worked in therapeutic treatment. I do massage and acupuncture.", "My favorite food is pizza. I like eating Cheetos.", "The Bears is my favorite NFL team. I loved Cutler when he played for the Bears. I have never been to a soccer match. I have been to a soccer field before.", "I go to acupuncture, I believe it works.", "I am unfamiliar with fantasy RPG styles games."]], "init_personas": [["I am a gamer.", "I like playing league of legends.", "My favorite champion is alistar.", "I got a new gaming laptop last month.", "I love playing video games with friends."], ["I am blonde.", "I like to watch football.", "My mom is a nurse.", "I am a therapist.", "My favorite food is pizza."]]}]